# Brewfile for dotfiles

# Core utilities
brew "stow"           # Symlink farm manager for dotfiles
brew "jq"             # Lightweight and flexible command-line JSON processor
brew "ripgrep"        # Search tool like grep, but faster
brew "fd"             # Simple, fast and user-friendly alternative to find
brew "bat"            # Cat clone with syntax highlighting
brew "fzf"            # Command-line fuzzy finder

# Modern Unix replacements
brew "eza"            # Modern replacement for ls
brew "zoxide"         # Smarter cd command with frecency
brew "git-delta"      # Syntax-highlighting pager for git, diff, and grep
brew "duf"            # Disk usage utility (df replacement)
brew "dust"           # More intuitive du
brew "procs"          # Modern replacement for ps
brew "bottom"         # Modern replacement for top (btm command)
brew "glances"        # Cross-platform system monitoring tool
brew "gping"          # Ping with a graph

# Developer utilities
brew "tealdeer"       # Fast tldr client (Rust implementation)
brew "httpie"         # User-friendly HTTP client
brew "sd"             # Intuitive find & replace (sed alternative)
brew "hyperfine"      # Command-line benchmarking tool
brew "thefuck"        # Corrects errors in previous console commands
brew "ast-grep"       # Structural search/replace tool based on AST

# Development tools
brew "mise"           # Dev environment manager
brew "gh"             # GitHub CLI
brew "starship"       # Cross-shell prompt
brew "helix"          # Modern modal text editor
brew "mosh"           # Mobile shell (SSH replacement for poor connections)
brew "gradle"         # Build automation tool

# Fonts (homebrew/cask-fonts tap is deprecated, fonts are in main repo now)
cask "font-jetbrains-mono-nerd-font" # Nerd Font for terminal icons

# Casks (macOS applications)
cask "ghostty"        # GPU-accelerated terminal emulator
cask "visual-studio-code" # Code editor
cask "zed"            # Code editor
cask "kiro"           # AI-powered IDE with spec-driven development
cask "kiro-cli"       # Kiro AI CLI for terminal
